import React, { PropTypes } from 'react'
import TopBar from '../components/common/top_bar'

class ProtocolContent extends React.Component {
  constructor(){
    super()
  }

  render(){
    return (
      <div className="protocol_content">
        <h2>好买车用户服务协议</h2>
        <p>本协议是您与好买车网（简称“本站”，网址：www.haomaiche.com）所有者（以下简称为“好买车网”）之间就好买车网站服务等相关事宜所订立的契约，请您仔细阅读本协议，您选择“同意并注册”后，本协议即构成对双方有约束力的法律文件。</p>
        <h3>一、服务条款的确认和接纳</h3>
        <p>本站的各项电子服务的所有权和运作权归本站,本站提供的服务将完全按照其发布的服务条款和操作规则严格执行。用户同意所有服务条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的约定，除非违反国家强制性法律，否则始终有效（同时，未满18岁或其他不完全民事行为能力人的用户使用本服务必须取得监护人的同意）。在您询价、注册、预约等操作过程中，您必须保证向本站提供的所有需求及注册信息的完整性、真实性，如上述信息发生变更时，请及时更新您的个人信息，否则，造成的一切后果由用户自行承担 。</p>
        <h3>二、服务与声明</h3>
        <p>用户在向本站提供真实、完整、有效的需求及注册等信息后，本站向用户提供以下服务：<br/>1. 在用户注册成功后，本站会为每位用户建立并开通一个账户，作为其使享受本站服务的唯一身份标识，与此账户相关的账号信息及认证信息，用户需自行妥善保管，该账户下所有操作均视为用户本人行为，因用户保管不善导致账号或认证信息泄露，造成用户损失的，本站不承担任何责任。<br/>2. 本站默认每位用户至多有且只能拥有一个本站账户，如用户通过个人手段注册或拥有本站多个账户，本站经核实情况属实的，本站有权不经过用户允许，采取删除用户操作数据、取消订单、冻结或关闭用户账户、拒绝提供服务等措施，给本站及相关方造成损失的，用户应承担赔偿责任。<br/>3. 针对在本站注册成功的所有用户，可平等享受本站提供的各类车型资讯信息、报价信息、及优惠政策等所有相关服务，本站作为平台，尽最大努力监督和保证“本站平台相关商户提供的商品及资讯信息正确、有效。”<br/>4. 当用户因本站平台提供的信息及服务，与本站相关商户发生分歧与纠纷时，本站在依据事实的基础上，有权对用户及商户双方进行调解，如果事实依据表明违约责任在商户方的，本站有义务帮助用户举证。<br/>5. 用户通过本站平台进行打款行为，支付诚意金、订金等款项的，网站将作为第三方的身份，在用户未进行资金去向操作期间保障资金安全。在用户进行资金去向操作后，例如确认下定支付，资金安全将由用户个人及与之相关的商户负责，本站将不对此项资金负责；<br/>对于任何影响或可能影响用户权利的情况或行为，用户有权向本站进行反馈，并提供相应证据资料，需要本站协助解决的，应提供有事实依据的举证材料。</p>
        <h3>三、服务条款的修改</h3>
        <p>本网站有权在必要时修改服务条款，本网站的服务条款一旦发生变动，将会在本网站的重要页面上提示修改内容，用户如不同意新的修改内容，须立即停止使用本协议约定的服务，否则视为用户完全同意并接受新的修改内容。根据客观情况及经营策略的变化，本网站有中断或停止服务的权利，用户对此表示理解并完全认同。</p>
        <h3>四、用户隐私</h3>
        <p>本站尊重每一位用户的隐私权，对用户的手机号、银行账户、注册信息等隐私资料进行保护，承诺不会在用户未授权的情况下公开、编辑或透露这些资料及保存在本站中的非公开内容， 除以下情况外：<br/>（1） 用户授权本站透露、编辑这些信息；<br/>（2） 用户主动或同意公开个人资料，享受本站为其提供的产品和服务；<br/>（3）相应的法律及程序要求本站提供用户的个人资料；</p>
        <h3>五、用户管理</h3>
        <p>本协议依据国家相关法律法规规章制定，用户同意并严格遵守以下条款：<br/>（1） 不利用本站传输任何违反宪法和法律行政法规的信息资料；<br/>（2） 不传输损害国家社会公共利益和涉及国家安全的信息资料；<br/>（3） 不干扰或混乱网络的正常秩序及服务<br/>（4） 遵守所有使用网络服务的网络协议、规定、程序和惯例。<br/>若用户的行为不符合以上提到的服务条款，本站将作出独立判断，立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。用户若在本站上散布和传播反动、色情或其它违反国家法律的信息，本站的系统记录有可能作为用户违反法律的证据。</p>
        <h3>六、本站服务内容的所有权</h3>
        <p>本站定义的网络服务内容包括：<br/>（1） 文字、软件、声音、图片、录象、图表、广告中的全部内容；<br/>（2） 电子邮件及短信的全部内容；<br/>（3） 本站为用户提供的其它信息。<br/>所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在本站和商家授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</p>
        <h3>七、责任限制</h3>
        <p>如因不可抗力或其它本站无法控制的原因使本站服务系统崩溃或无法正常使用而导致用户网上操作流程无法完成或丢失有关的信息、记录等本站会尽可能合理地协助处理善后事宜，并尽最大努力使客户免受损失。</p>
        <h3>八、法律管辖和适用</h3>
        <p>本协议所有相关条款，本站拥有最终解释权。本协议的订立、执行和解释及争议的解决均应适用中国法律，如发生本站服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向人民法院提起诉讼。</p>
      </div>
    )
  }
}

class Protocol extends React.Component {
  constructor(){
    super()
  }
  
  render(){
    return (
      <div className="protocol">
        <TopBar pageTitle="好买车用户服务协议"/>
        <ProtocolContent/>
      </div>
    )
  }
}

export default Protocol
